# EKSİK-KAYIP VERİ

In [43]:
import pandas as pd
import numpy as np

In [3]:
s=pd.Series(["Rex",np.nan,"Jesse","White"])

In [4]:
s

0      Rex
1      NaN
2    Jesse
3    White
dtype: object

In [5]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [6]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

Belli bir indexteki veriyi NaN değerini atayabiliriz.

In [7]:
s[3]=None

In [9]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

Eksik verileri uzaklaştırmak için dropna methodu kullanılabilir. Aynı şekilde s[s.notnull()] da kullanılabilir.

In [10]:
s.dropna()

0      Rex
2    Jesse
dtype: object

In [11]:
s[s.notnull()]

0      Rex
2    Jesse
dtype: object

Şimdi DataFrame veri yapısında eksik verileri nasıl kaldıracağımızı göreceğiz.

In [47]:
from numpy import nan as NA

In [48]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

dropna methodu ön tanımlı olarak eksik veri olan tüm satırları kaldırır.

In [49]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

eğer how=all seçeneğini eklersek tüm satırları NaN olan değerleri kaldırır.

In [50]:
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

eğer axis=1 seçeneğini eklersek tüm satırları NaN olan değerleri kaldırır.

In [51]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [52]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [53]:
df[1]=NA

In [54]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [55]:
df.dropna(axis=1, how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

En az bir değeri bulunan satırları ekrana yazdırmak için thresh=1 modülü kullanılabilir.

In [56]:
df.dropna(thresh=1)

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

Eksik verilere bir değr atamak istiyorsak fillna methodu kullanılır.

In [57]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

Her bir sütuna ayrı değer atamak söz konusu ise;

In [58]:
df.fillna({0:15,1:20,2:35})

      0     1     2
0   1.0  20.0   3.0
1   4.0  20.0   5.0
2  15.0  20.0  35.0

fillna methodundan sonra veri setinde düzenleme yapmamız gerekiyorsa inplace opsiyonu kullanılır. Çünkü fillna methodu kalıcı olarak değerleri kaydetmez.

In [59]:
df.fillna(0,inplace=True)
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

Eksik verilere bir üst satırındaki değerleri atamak istersek ffill methodunu kullanırız.

In [60]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [61]:
df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

Eğer eksik verilere sınırlandırarak bir üst satırdaki verileri atamak istersek method="ffill" ile limit opsiyonu kulllanılır.

In [62]:
df.fillna(method="ffill",limit=1) #bir sütundaki yalnızca bir tane NaN değeri tamalanmış olur

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0